InformationRegisters/ОчередьОтправкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОчередьОтправкиУведомлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзменилась</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИзменился</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запись</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Запись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Запись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаписей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МедицинскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ОтправкаПисемПоПочте/Ext/Module.bsl
Процедура ОтправитьПисьма() Экспорт 
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОтправкаПочты);
	Письма = Новый Массив;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОтправкиУведомлений.Документ КАК Документ,
		|	ОчередьОтправкиУведомлений.ДатаПриема КАК ДатаПриема,
		|	ОчередьОтправкиУведомлений.Статус КАК Статус,
		|	ОчередьОтправкиУведомлений.Отправлено КАК Отправлено,
		|	ОчередьОтправкиУведомлений.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ОчередьОтправкиУведомлений.ДатаИзменилась КАК ДатаИзменилась,
		|	ОчередьОтправкиУведомлений.СтатусИзменился КАК СтатусИзменился,
		|	ОчередьОтправкиУведомлений.Документ.Клиент.АдресЭП КАК АдресЭП,
		|	ОчередьОтправкиУведомлений.Документ.Клиент КАК Клиент
		|ИЗ
		|	РегистрСведений.ОчередьОтправкиУведомлений КАК ОчередьОтправкиУведомлений
		|ГДЕ
		|	ОчередьОтправкиУведомлений.Отправлено = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Письмо=Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема="Запись на прием к врачу.";
		Письмо.ИмяОтправителя="MedStyle";
		Письмо.Отправитель="timofei.melnickov2015@yandex.ru";
		Письмо.Получатели.Добавить(Выборка.АдресЭП);
		
		ТекстПисьма = СтрШаблон("Уважаемый %1, ", Выборка.Клиент);
		Если Выборка.ДатаИзменилась Тогда
			ТекстПисьма = ТекстПисьма + "время вашего приема изменилось!"
		ИначеЕсли Выборка.СтатусИзменился Тогда
			ТекстПисьма = ТекстПисьма + "статус вашей записи изменился!"
		Иначе
			ТекстПисьма = ТекстПисьма + "отправляем Вам талон на прием!"
		КонецЕсли;
		Письмо.Тексты.Добавить(ТекстПисьма);
		ТабДок = Новый ТабличныйДокумент;
		Документы.Запись.Печать(ТабДок, Выборка.Документ);
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		Письмо.Вложения.Добавить(ИмяФайла, "Талон");
		Письма.Добавить(Письмо);
		
		МенеджерЗаписи = РегистрыСведений.ОчередьОтправкиУведомлений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = Выборка.Документ;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Отправлено = Истина;
		МенеджерЗаписи.ДатаИзменилась = Ложь;
		МенеджерЗаписи.СтатусИзменился = Ложь;
		МенеджерЗаписи.Записать(Истина);
	КонецЦикла;
	ТекстОшибки = "";
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	РаботаСПочтовымиСообщениями.ОтправитьПисьма(УчетнаяЗапись, Письма, ТекстОшибки);
КонецПроцедуры
